<!DOCTYPE html><html><head>
    <title>doc</title>
    <meta charset="utf-8">
    <link rel="stylesheet" href="_css/_vs.css">
    <link rel="stylesheet" href="_css/booksample.css">
  </head>
  <body>
<div class="coverpage"><h1 id="c-br-">C#&#x306E;&#x57FA;&#x672C;&#x4E2D;&#x306E;&#x57FA;&#x672C;&#x3092;<br>&#x899A;&#x3048;&#x3088;&#x3046;</h1></div>
<div class="secheader"><h2 id="-br-">&#x6700;&#x521D;&#x306E;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3092;<br>&#x66F8;&#x3044;&#x3066;&#x307F;&#x3088;&#x3046;<span class="header2">&#x6700;&#x521D;&#x306E;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3092;&#x66F8;&#x3044;&#x3066;&#x307F;&#x3088;&#x3046;</span></h2></div>
<p class="face student student-shock">&#x30AB;&#x30C3;&#x30B3;&#x304C;&#x91CD;&#x306A;&#x308B;&#x3068;&#x3084;&#x3084;&#x3053;&#x3057;&#x3044;&#x3067;&#x3059;&#x306D;&#x30FC;&#x3002;print&#x95A2;&#x6570;&#x306E;&#x30AB;&#x30C3;&#x30B3;&#x3082;&#x3042;&#x308A;&#x307E;&#x3059;&#x3057;&#x3002;<img src="_css/img/apron_woman2-2shock.png" style="display:none;"></p>
<p class="face teacher teacher-laugh">&#x5185;&#x5074;&#x306E;&#x30AB;&#x30C3;&#x30B3;&#x307B;&#x3069;&#x512A;&#x5148;&#x3059;&#x308B;&#x3068;&#x899A;&#x3048;&#x3066;&#x304A;&#x304F;&#x3068;&#x697D;&#x3060;&#x3088;&#x3002;<img src="_css/img/apron_man1-4laugh.png" style="display:none;"></p>
<p class="face student">&#x6587;&#x7AE0;&#x30C0;&#x30DF;&#x30FC;&#x3002;&#x5185;&#x5074;&#x306E;&#x30AB;&#x30C3;&#x30B3;&#x307B;&#x3069;&#x512A;&#x5148;&#x3059;&#x308B;&#x3068;&#x899A;&#x3048;&#x3066;&#x304A;&#x304F;&#x3068;&#x697D;&#x3067;&#x3059;&#x306D;&#x3002;<img src="_css/img/apron_woman1-1smile.png" style="display:none;"></p>
<p class="face teacher">&#x5185;&#x5074;&#x306E;&#x30AB;&#x30C3;&#x30B3;&#x307B;&#x3069;&#x512A;&#x5148;&#x3059;&#x308B;&#x3068;&#x899A;&#x3048;&#x3066;&#x304A;&#x304F;&#x3068;&#x697D;&#x3060;&#x3088;&#x3002;<img src="_css/img/apron_man1-1smile.png" style="display:none;"></p>
<p class="face student student-idea">&#x5185;&#x5074;&#x306E;&#x30AB;&#x30C3;&#x30B3;&#x307B;&#x3069;&#x512A;&#x5148;&#x3059;&#x308B;&#x3068;&#x899A;&#x3048;&#x3066;&#x304A;&#x304F;&#x3068;&#x697D;&#x3060;&#x3088;&#x3002;<img src="_css/img/apron_woman2-1idea.png" style="display:none;"></p>
<h3 id="-">&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x4E2D;&#x306B;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x3092;&#x8FFD;&#x52A0;&#x3057;&#x3088;&#x3046;</h3>
<h4 id="-">&#x25CF;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x4F5C;&#x6210;</h4>
<p>Unity&#x3067;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3092;&#x66F8;&#x304F;&#x306B;&#x306F;&#x3001;&#x305D;&#x306E;&#x524D;&#x306B;&#x3044;&#x304F;&#x3064;&#x304B;&#x4F5C;&#x6210;&#x3057;&#x306A;&#x3051;&#x308C;&#x3070;&#x3044;&#x3051;&#x306A;&#x3044;&#x3082;&#x306E;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x6700;&#x521D;&#x306B;&#x3064;&#x304F;&#x308B;&#x306E;&#x306F;<strong>&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;</strong>&#x3067;&#x3059;&#x3002;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306F;&#x30B2;&#x30FC;&#x30E0;&#x306B;&#x5FC5;&#x8981;&#x306A;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3084;&#x753B;&#x50CF;&#x3001;&#x97F3;&#x697D;&#x306A;&#x3069;&#x306E;&#x30C7;&#x30FC;&#x30BF;&#x3092;&#x307E;&#x3068;&#x3081;&#x308B;&#x5BB9;&#x308C;&#x7269;&#x3067;&#x3059;&#x3002;</p>
<p>Unity&#x30A8;&#x30C7;&#x30A3;&#x30BF;&#x306E;&#x8D77;&#x52D5;&#x6642;&#x306B;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;<strong>&#x30DB;&#x30FC;&#x30E0;&#x753B;&#x9762;</strong>&#x3067;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3092;&#x4F5C;&#x6210;&#x3057;&#x307E;&#x3059;&#x3002;&#x540D;&#x524D;&#x306F;&#x300C;FirstLesson&#x300D;&#x3068;&#x3057;&#x3001;&#x4FDD;&#x5B58;&#x5834;&#x6240;&#x306F;&#x3069;&#x3053;&#x3067;&#x3082;&#x3044;&#x3044;&#x306E;&#x3067;&#x3068;&#x308A;&#x3042;&#x3048;&#x305A;&#xFF3B;&#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#xFF3D;&#x30D5;&#x30A9;&#x30EB;&#x30C0;&#xFF08;Mac&#x3067;&#x306F;&#xFF3B;&#x66F8;&#x985E;&#xFF3D;&#x30D5;&#x30A9;&#x30EB;&#x30C0;&#xFF09;&#x306B;&#x3057;&#x3066;&#x304A;&#x304D;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;</p>
<h4 id="-unity-">&#x25CF;Unity&#x30A8;&#x30C7;&#x30A3;&#x30BF;&#x306E;&#x753B;&#x9762;&#x5404;&#x90E8;&#x306E;&#x540D;&#x79F0;</h4>
<p>&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3092;&#x4F5C;&#x6210;&#x3059;&#x308B;&#x3068;&#x3001;&#x305D;&#x306E;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x304C;&#x958B;&#x304B;&#x308C;&#x305F;&#x72B6;&#x614B;&#x3067;Unity&#x30A8;&#x30C7;&#x30A3;&#x30BF;&#x304C;&#x8D77;&#x52D5;&#x3057;&#x307E;&#x3059;&#x3002;&#x3053;&#x3053;&#x3067;&#x753B;&#x9762;&#x5404;&#x90E8;&#x306E;&#x540D;&#x79F0;&#x3068;&#x5F79;&#x5272;&#x3092;&#x7C21;&#x5358;&#x306B;&#x8AAC;&#x660E;&#x3057;&#x3066;&#x304A;&#x304D;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;Windows&#x7248;&#x3082;Mac&#x7248;&#x3082;&#x753B;&#x9762;&#x306F;&#x307B;&#x3068;&#x3093;&#x3069;&#x4E00;&#x7DD2;&#x3067;&#x3059;&#x304C;&#x3001;Mac&#x3067;&#x306F;&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x30D0;&#x30FC;&#x306F;&#x30C7;&#x30B9;&#x30AF;&#x30C8;&#x30C3;&#x30D7;&#x306E;&#x4E0A;&#x90E8;&#x306B;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x307E;&#x305F;&#x3001;&#x753B;&#x9762;&#x69CB;&#x6210;&#x306F;&#x4F7F;&#x3044;&#x3084;&#x3059;&#x3044;&#x3088;&#x3046;&#x306B;&#x30AB;&#x30B9;&#x30BF;&#x30DE;&#x30A4;&#x30BA;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x307E;&#x3059;&#xFF08;P.&#x25A0;&#x25A0;&#x306E;&#x30B3;&#x30E9;&#x30E0;&#x3092;&#x53C2;&#x7167;&#xFF09;&#x3002;</p>
<div class="figure">
<svg width="110mm" height="65mm" viewBox="0 0 110 65">
<image width="448.733" height="279.753" href="img2/c2s1-4.png" transform="translate(0,0) scale(0.25)"> 
</image></svg> 

<ul>
<li>&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x30D0;&#x30FC;&#xFF0F;&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x30D0;&#x30FC;&#xFF0F;&#x30C4;&#x30FC;&#x30EB;&#x30D0;&#x30FC;</li>
<li>&#xFF3B;Hierarchy&#xFF3D;&#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;</li>
<li>&#xFF3B;Inspector&#xFF3D;&#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;</li>
<li>&#xFF3B;Scene&#xFF3D;&#x30D3;&#x30E5;&#x30FC;&#xFF0F;&#xFF3B;Game&#xFF3D;&#x30D3;&#x30E5;&#x30FC;</li>
<li>&#xFF3B;Project&#xFF3D;&#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;&#xFF0F;&#xFF3B;Console&#xFF3D;&#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;</li>
<li>&#x30B9;&#x30C6;&#x30FC;&#x30BF;&#x30B9;&#x30D0;&#x30FC;
</li></ul></div>

<table>
<thead>
<tr>
<th>&#x540D;&#x524D;</th>
<th>&#x50CD;&#x304D;</th>
</tr>
</thead>
<tbody>
<tr>
<td>&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x30D0;&#x30FC;</td>
<td>&#x7DE8;&#x96C6;&#x4E2D;&#x306E;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x540D;&#x524D;&#x306A;&#x3069;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;</td>
</tr>
<tr>
<td>&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x30D0;&#x30FC;</td>
<td>Unity&#x30A8;&#x30C7;&#x30A3;&#x30BF;&#x306E;&#x6A5F;&#x80FD;&#x3092;&#x547C;&#x3073;&#x51FA;&#x3059;&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x304C;&#x914D;&#x7F6E;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;</td>
</tr>
<tr>
<td>&#x30C4;&#x30FC;&#x30EB;&#x30D0;&#x30FC;</td>
<td>&#x52D5;&#x4F5C;&#x30C6;&#x30B9;&#x30C8;&#x3092;&#x5B9F;&#x884C;&#x3059;&#x308B;&#x30DC;&#x30BF;&#x30F3;&#x306A;&#x3069;&#x304C;&#x914D;&#x7F6E;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;</td>
</tr>
<tr>
<td>&#xFF3B;Hierarchy&#xFF3D;&#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;</td>
<td>&#x30B7;&#x30FC;&#x30F3;&#x4E0A;&#x306B;&#x914D;&#x7F6E;&#x3055;&#x308C;&#x305F;&#x30B2;&#x30FC;&#x30E0;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x4E00;&#x89A7;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;</td>
</tr>
<tr>
<td>&#xFF3B;Inspector&#xFF3D;&#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;</td>
<td>&#x30B2;&#x30FC;&#x30E0;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306A;&#x3069;&#x306E;&#x8A2D;&#x5B9A;&#x3092;&#x78BA;&#x8A8D;&#x30FB;&#x5909;&#x66F4;&#x3059;&#x308B;</td>
</tr>
<tr>
<td>&#xFF3B;Scene&#xFF3D;&#x30D3;&#x30E5;&#x30FC;</td>
<td>&#x30B2;&#x30FC;&#x30E0;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306A;&#x3069;&#x3092;&#x914D;&#x7F6E;&#x3059;&#x308B;&#x7DE8;&#x96C6;&#x753B;&#x9762;</td>
</tr>
<tr>
<td>&#xFF3B;Game&#xFF3D;&#x30D3;&#x30E5;&#x30FC;</td>
<td>&#x52D5;&#x4F5C;&#x30C6;&#x30B9;&#x30C8;&#x4E2D;&#x306E;&#x30B2;&#x30FC;&#x30E0;&#x3092;&#x8868;&#x793A;&#x3059;&#x308B;&#x753B;&#x9762;</td>
</tr>
<tr>
<td>&#xFF3B;Project&#xFF3D;&#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;</td>
<td>&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306B;&#x542B;&#x307E;&#x308C;&#x308B;&#x5404;&#x7A2E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;</td>
</tr>
<tr>
<td>&#xFF3B;Console&#xFF3D;&#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;</td>
<td>&#x30A8;&#x30E9;&#x30FC;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x306A;&#x3069;&#x3092;&#x8868;&#x793A;&#x3059;&#x308B;&#x753B;&#x9762;</td>
</tr>
<tr>
<td>&#x30B9;&#x30C6;&#x30FC;&#x30BF;&#x30B9;&#x30D0;&#x30FC;</td>
<td>&#x7C21;&#x6613;&#x7684;&#x306A;&#x30A8;&#x30E9;&#x30FC;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x306A;&#x3069;&#x3092;&#x4E00;&#x884C;&#x3067;&#x8868;&#x793A;&#x3059;&#x308B;</td>
</tr>
</tbody>
</table>
<div class="cap">
&#x5404;&#x90E8;&#x306E;&#x540D;&#x79F0;&#x3068;&#x50CD;&#x304D;
</div>
<h4 id="-">&#x25CF;&#x30B7;&#x30FC;&#x30F3;&#x306E;&#x4FDD;&#x5B58;</h4>
<p>&#x7D9A;&#x3044;&#x3066;&#x884C;&#x3046;&#x4F5C;&#x696D;&#x306F;<strong>&#x30B7;&#x30FC;&#x30F3;</strong>&#x306E;&#x4FDD;&#x5B58;&#x3067;&#x3059;&#x3002;&#x30B7;&#x30FC;&#x30F3;&#x3068;&#x3044;&#x3046;&#x306E;&#x306F;&#x3001;&#x7C21;&#x5358;&#x306B;&#x3044;&#x3048;&#x3070;&#x30B2;&#x30FC;&#x30E0;&#x5185;&#x306E;1&#x753B;&#x9762;&#x306E;&#x30C7;&#x30FC;&#x30BF;&#x3067;&#x3059;&#x3002;&#x300C;&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x753B;&#x9762;&#x300D;&#x300C;&#x30B2;&#x30FC;&#x30E0;&#x30E1;&#x30A4;&#x30F3;&#x753B;&#x9762;&#x300D;&#x300C;&#x30AF;&#x30EA;&#x30A2;&#x753B;&#x9762;&#x300D;&#x306A;&#x3069;&#x5FC5;&#x8981;&#x306B;&#x5FDC;&#x3058;&#x3066;&#x8FFD;&#x52A0;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p>
<p>&#x30B7;&#x30FC;&#x30F3;&#x306F;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x4F5C;&#x6210;&#x6642;&#x306B;&#x81EA;&#x52D5;&#x4F5C;&#x6210;&#x3055;&#x308C;&#x308B;&#x306E;&#x3067;&#x3001;&#x300C;scene1&#x300D;&#x3068;&#x3044;&#x3046;&#x540D;&#x524D;&#x3067;&#x4FDD;&#x5B58;&#x3057;&#x3066;&#x307F;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;</p>
<div class="figure">
<svg width="110mm" height="45mm" viewBox="0 0 110 45">
<image width="448.733" height="279.753" href="img2/c2s1-6.png" transform="translate(0,0) scale(0.4)"> 
</image></svg> 

<ul>
<li>&#xFF3B;File&#xFF3D;&#x2192;&#xFF3B;Save Scene&#xFF3D;&#x3092;&#x9078;&#x629E;
</li></ul></div>

<div class="figure">
<svg width="101.988mm" height="63.959mm" viewBox="0 0 101.988 63.959">
<image width="291.394" height="182.739" href="img2/c2s1-7.png" transform="translate(0,0) scale(0.35)"> 
</image></svg> 

<ul>
<li>&#x4FDD;&#x5B58;&#x5834;&#x6240;&#x3092;&#x78BA;&#x8A8D;</li>
<li>&#xFF3B;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x540D;&#xFF3D;&#x306B;&#x300C;scene1&#x300D;&#x3068;&#x5165;&#x529B;</li>
<li>&#xFF3B;&#x4FDD;&#x5B58;&#xFF3D;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;
</li></ul></div>

<div class="figure">
<svg width="110mm" height="15mm" viewBox="0 0 110 15">
<image width="448.733" height="279.753" href="img2/c2s1-8.png" transform="translate(0,0) scale(0.5)"> 
</image></svg> 

<ul>
<li>&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x30D0;&#x30FC;&#x306B;&#x30B7;&#x30FC;&#x30F3;&#x540D;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;
</li></ul></div>

<h3 id="-">&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x3092;&#x5165;&#x529B;&#x3057;&#x3088;&#x3046;</h3>
<h4 id="-monodevelop-">&#x25CF;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x3092;MonoDevelop&#x3067;&#x958B;&#x304F;</h4>
<p>&#x305D;&#x308C;&#x3067;&#x306F;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x3092;&#x5165;&#x529B;&#x3057;&#x3066;&#x3044;&#x304D;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;Unity&#x306B;&#x306F;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x3092;&#x7DE8;&#x96C6;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;<strong>MonoDevelop&#xFF08;&#x30E2;&#x30CE;&#x30C7;&#x30D9;&#x30ED;&#x30C3;&#x30D7;&#xFF09;</strong>&#x3068;&#x3044;&#x3046;&#x30A8;&#x30C7;&#x30A3;&#x30BF;&#x304C;&#x4ED8;&#x5C5E;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#xFF3B;Project&#xFF3D;&#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;&#x306B;&#x8868;&#x793A;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x306E;&#x30A2;&#x30A4;&#x30B3;&#x30F3;&#x3092;&#x30C0;&#x30D6;&#x30EB;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3059;&#x308B;&#x3068;&#x3001;&#x81EA;&#x52D5;&#x7684;&#x306B;MonoDevelop&#x304C;&#x8D77;&#x52D5;&#x3057;&#x3066;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x304C;&#x958B;&#x304B;&#x308C;&#x307E;&#x3059;&#x3002;</p>
<h6 id="lesson1-cs">Lesson1.cs</h6>
<pre><code class="lang-csharp"><span class="hljs-keyword">using</span> UnityEngine;
<span class="hljs-keyword">using</span> System.Collections;

<span class="hljs-keyword">public</span> <span class="hljs-keyword">class</span> <span class="hljs-title">Lesson1</span> : <span class="hljs-title">MonoBehaviour</span> {

    <span class="hljs-comment">// Use this for initialization</span>
    <span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">Start</span> (<span class="hljs-params"></span>) </span>{
        Debug.Log (<span class="hljs-string">&quot;&#x30CF;&#x30ED;&#x30FC;&quot;</span>);&#x3000;  <span class="hljs-comment codered">&#x3053;&#x3053;&#x3092;&#x5165;&#x529B;</span>
    }

    <span class="hljs-comment">// Update is called once per frame</span>
    <span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">Update</span> (<span class="hljs-params"></span>) </span>{

    }
}
</code></pre>

<p>&#x5165;&#x529B;&#x306E;&#x3068;&#x304D;&#x306B;&#x307E;&#x305A;&#x6CE8;&#x610F;&#x3057;&#x3066;&#x307B;&#x3057;&#x3044;&#x306E;&#x306F;&#x3001;&#x65E5;&#x672C;&#x8A9E;&#x5165;&#x529B;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3092;&#x30AA;&#x30D5;&#x306B;&#x3057;&#x3066;<strong>&#x534A;&#x89D2;&#x82F1;&#x6570;&#x5B57;&#x3067;&#x5165;&#x529B;</strong>&#x3057;&#x306A;&#x3044;&#x3068;&#x3044;&#x3051;&#x306A;&#x3044;&#x3068;&#x3044;&#x3046;&#x70B9;&#x3067;&#x3059;&#x3002;&#x65E5;&#x672C;&#x8A9E;&#x3092;&#x5165;&#x529B;&#x3059;&#x308B;&#x3068;&#x304D;&#x3060;&#x3051;&#x30AA;&#x30F3;&#x306B;&#x3057;&#x3066;&#x3001;&#x5165;&#x529B;&#x304C;&#x7D42;&#x308F;&#x3063;&#x305F;&#x3089;&#x3059;&#x3050;&#x306B;&#x30AA;&#x30D5;&#x306B;&#x3059;&#x308B;&#x304F;&#x305B;&#x3092;&#x4ED8;&#x3051;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;&#x30A2;&#x30EB;&#x30D5;&#x30A1;&#x30D9;&#x30C3;&#x30C8;&#x306E;<strong>&#x5927;&#x6587;&#x5B57;&#x5C0F;&#x6587;&#x5B57;</strong>&#x3082;&#x9593;&#x9055;&#x3048;&#x3066;&#x306F;&#x3044;&#x3051;&#x307E;&#x305B;&#x3093;&#x3002;</p>
<div class="secheader"><h2 id="-">&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306E;&#x57FA;&#x672C;&#x7684;&#x306A;&#x7528;&#x8A9E;&#x3092;&#x899A;&#x3048;&#x3088;&#x3046;<span class="header2">&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306E;&#x57FA;&#x672C;&#x7684;&#x306A;&#x7528;&#x8A9E;&#x3092;&#x899A;&#x3048;&#x3088;&#x3046;</span></h2></div>
<p>&#x3055;&#x3063;&#x304D;&#x306F;&#x7279;&#x306B;&#x8AAC;&#x660E;&#x3082;&#x305B;&#x305A;&#x306B;&#x5165;&#x529B;&#x3057;&#x3066;&#x3082;&#x3089;&#x3044;&#x307E;&#x3057;&#x305F;&#x304C;&#x3001;&#x4ECA;&#x5EA6;&#x306F;&#x305D;&#x308C;&#x305E;&#x308C;&#x306E;&#x610F;&#x5473;&#x3092;&#x8AAC;&#x660E;&#x3057;&#x3066;&#x3044;&#x304D;&#x307E;&#x3059;&#x3002;&#x30AF;&#x30E9;&#x30B9;&#x3001;&#x30E1;&#x30BD;&#x30C3;&#x30C9;&#x3001;&#x30D6;&#x30ED;&#x30C3;&#x30AF;&#x3001;&#x6F14;&#x7B97;&#x5B50;&#x3001;&#x5F0F;&#x3068;&#x3044;&#x3063;&#x305F;&#x7528;&#x8A9E;&#x304C;&#x308F;&#x304B;&#x3063;&#x3066;&#x304F;&#x308B;&#x3068;&#x3001;&#x610F;&#x5473;&#x4E0D;&#x660E;&#x3060;&#x3063;&#x305F;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x306E;&#x6B63;&#x4F53;&#x304C;&#x898B;&#x3048;&#x3066;&#x304F;&#x308B;&#x306F;&#x305A;&#x3067;&#x3059;&#x3002;</p>
<h6 id="sample-py">sample.py</h6>
<pre><code class="lang-python"><span class="hljs-comment"># &#x901A;&#x5E38;&#x30B3;&#x30E1;&#x30F3;&#x30C8;</span>
<span class="hljs-keyword">for</span> cnt <span class="hljs-keyword">in</span> range(<span class="hljs-number">10</span>):
    print(cnt)        <span class="hljs-comment codered">&#x30B3;&#x30E1;&#x30F3;&#x30C8;&#x306E;&#x5148;&#x982D;&#x306B;&#x2190;&#x3092;&#x5165;&#x308C;&#x308B;&#x3068;&#x5F15;&#x304D;&#x51FA;&#x3057;&#x7DDA;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;</span>
print(<span class="hljs-string">&quot;done&quot;</span>)         <span class="hljs-comment codered">&#x6298;&#x308A;&#x8FD4;&#x3057;&#x306F;&#x306A;&#x3057;&#x306B;&#x3057;&#x305F;&#x3044;&#x3068;&#x3053;&#x308D;&#x3067;&#x3059;</span>
</code></pre>

<div class="column">
<h5 id="visual-studio-">Visual Studio&#x304C;&#x8D77;&#x52D5;&#x3057;&#x3066;&#x3057;&#x307E;&#x3046;&#x3068;&#x304D;&#x306F;&#xFF1F;</h5>
<p>&#x30D1;&#x30BD;&#x30B3;&#x30F3;&#x306B;Visual Studio&#x304C;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x5834;&#x5408;&#x3001;&#x305D;&#x3061;&#x3089;&#x304C;&#x8D77;&#x52D5;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x305D;&#x308C;&#x3067;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x3092;&#x7DE8;&#x96C6;&#x3057;&#x3066;&#x3082;&#x554F;&#x984C;&#x306A;&#x3044;&#x306E;&#x3067;&#x3059;&#x304C;&#x3001;MonoDevelop&#x3092;&#x4F7F;&#x3044;&#x305F;&#x3044;&#x5834;&#x5408;&#x306F;&#x3001;Unity&#x30A8;&#x30C7;&#x30A3;&#x30BF;&#x306E;&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x304B;&#x3089;&#xFF3B;Edit&#xFF3D;&#x2192;&#xFF3B;Preferences&#xFF3D;&#x3092;&#x9078;&#x629E;&#x3057;&#x3001;&#xFF3B;Unity Preferences&#xFF3D;&#x30C0;&#x30A4;&#x30A2;&#x30ED;&#x30B0;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x306E;&#xFF3B;External Tools&#xFF3D;&#x3067;&#xFF3B;MonoDevelop&#xFF3D;&#x3092;&#x9078;&#x629E;&#x3057;&#x307E;&#x3059;&#x3002;
</p><div class="figure">
<svg width="70.556mm" height="40mm" viewBox="0 0 70.556 40">
<image width="176.389" height="150.283" href="img2/c2s1-21.png" transform="translate(0,0) scale(0.4)"> 
</image></svg> 

<ul>
<li>&#xFF3B;MonoDevelop (built-in)&#xFF3D;&#x3092;&#x9078;&#x629E;</li>
</ul>
<div class="cap">
&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x30A8;&#x30C7;&#x30A3;&#x30BF;&#x306E;&#x5207;&#x308A;&#x66FF;&#x3048;
</div>
</div>
</div>
<div class="secheader"><h2 id="2-">2&#x3064;&#x3081;&#x306E;&#x30BB;&#x30AF;&#x30B7;&#x30E7;&#x30F3;<span class="header2">2&#x3064;&#x3081;&#x306E;&#x30BB;&#x30AF;&#x30B7;&#x30E7;&#x30F3;</span></h2></div>
<p class="face teacher teacher-laugh">&#x5185;&#x5074;&#x306E;&#x30AB;&#x30C3;&#x30B3;&#x307B;&#x3069;&#x512A;&#x5148;&#x3059;&#x308B;&#x3068;&#x899A;&#x3048;&#x3066;&#x304A;&#x304F;&#x3068;&#x697D;&#x3060;&#x3088;&#x3002;<img src="_css/img/apron_man1-4laugh.png" style="display:none;"></p>
<p class="face student">&#x5185;&#x5074;&#x306E;&#x30AB;&#x30C3;&#x30B3;&#x307B;&#x3069;&#x512A;&#x5148;&#x3059;&#x308B;&#x3068;&#x899A;&#x3048;&#x3066;&#x304A;&#x304F;&#x3068;&#x697D;&#x3067;&#x3059;&#x306D;&#x301C;&#x3002;<img src="_css/img/apron_woman1-1smile.png" style="display:none;"></p>
<h3 id="-">&#x307E;&#x305F;&#x4E2D;&#x898B;&#x51FA;&#x3057;&#x3067;&#x3059;</h3>
<p><strong>&#x7B87;&#x6761;&#x66F8;&#x304D;&#x306E;&#x30C7;&#x30B6;&#x30A4;&#x30F3;</strong>&#x3092;&#x6C7A;&#x3081;&#x307E;&#x3059;&#x3002;&#x672C;&#x6587;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x3002;&#x672C;&#x6587;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x3002;&#x672C;&#x6587;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x3002;&#x672C;&#x6587;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x3002;&#x672C;&#x6587;&#x30C6;s&#x30AD;&#x30B9;&#x30C8;&#x3002;&#x672C;&#x6587;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x3002;&#x672C;&#x6587;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x3002;</p>
<ul>
<li>&#x7B87;&#x6761;&#x66F8;&#x304D;&#x30A2;&#x30A4;&#x30C6;&#x30E0;1</li>
<li>&#x7B87;&#x6761;&#x66F8;&#x304D;&#x30A2;&#x30A4;&#x30C6;&#x30E0;2</li>
<li>&#x7B87;&#x6761;&#x66F8;&#x304D;&#x30A2;&#x30A4;&#x30C6;&#x30E0;3</li>
<li>&#x7B87;&#x6761;&#x66F8;&#x304D;&#x30A2;&#x30A4;&#x30C6;&#x30E0;4</li>
</ul>
<p>&#x8868;&#x7D44;&#x307F;&#x306E;&#x30C7;&#x30B6;&#x30A4;&#x30F3;&#x3092;&#x6C7A;&#x3081;&#x307E;&#x3059;&#x3002;&#x3002;&#x672C;&#x6587;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x3002;&#x672C;&#x6587;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x3002;&#x672C;&#x6587;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x3002;&#x672C;&#x6587;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x3002;&#x672C;&#x6587;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x3002;&#x672C;&#x6587;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x3002;&#x672C;&#x6587;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x3002;</p>
<h4 id="-h4-">&#x8868;&#x306E;&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x304C;&#x5FC5;&#x8981;&#x306A;&#x5834;&#x5408;&#x306F;&#x5C0F;&#x898B;&#x51FA;&#x3057;&#x3068;&#x540C;&#x3058;h4&#x3092;&#x4F7F;&#x7528;</h4>
<table>
<thead>
<tr>
<th>Header One</th>
<th>Header Two</th>
</tr>
</thead>
<tbody>
<tr>
<td>Item One</td>
<td>Item Two</td>
</tr>
<tr>
<td>Item One</td>
<td>Item Two</td>
</tr>
<tr>
<td>Item One</td>
<td>Item Two&#x8868;&#x306F;&#x5FC5;&#x305A;2&#x884C;&#x306B;&#x306A;&#x308B;&#x30D1;&#x30BF;&#x30FC;&#x30F3;&#x3092;&#x60F3;&#x5B9A;&#x3002;&#x9577;&#x3044;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x304C;&#x5165;&#x308B;&#x3053;&#x3068;&#x306F;&#x3088;&#x304F;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;</td>
</tr>
</tbody>
</table>

  

</body></html>